<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Firefox disk image and imports into LANDESK.
Values for RELEASE correspond to directories here: http://download-origin.cdn.mozilla.net/pub/mozilla.org/firefox/releases/
Some useful values are: 'latest', 'latest-10.0esr', 'latest-esr', 'latest-3.6', 'latest-beta'
LOCALE corresponds to directories at http://download-origin.cdn.mozilla.net/pub/mozilla.org/firefox/releases/$RELEASE/mac/
Examples include 'en-US', 'de', 'ja-JP-mac', 'sv-SE', and 'zh-TW'
No idea if all Firefox builds are available in all the same localizations, so you may need to verify that any particular
combination is offered.</string>
    <key>Identifier</key>
    <string>com.github.autopkg.landesk.firefox-rc-en_US</string>
    <key>Input</key>
    <dict>
        <key>LANDESK_PACKAGE_SERVER</key>
        <string>http://\%corename\%.eng.landesk.com/landesk/files/Adium_1.5.10.dmg</string>
        <key>NAME</key>
        <string>Firefox</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.autopkg.download.firefox-rc-en_US</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>package_name</key>
                <string>%NAME%</string>
                <key>output_file</key>
                <string>/tmp/firefox_mac.ldms</string>
                <key>primary_file</key>
                <string>%LANDESK_PACKAGE_SERVER%</string>
                <key>package_description</key>
                <string>Firefox for OS X</string>
            </dict>
            <key>Processor</key>
            <string>LANDESKImporter</string>
        </dict>
    </array>
</dict>
</plist>
